In [1]:
# import pandas
import pandas as pd
# from pandas import *

### Dataseries

In [2]:
list1 = [4,5,7,2]

In [4]:
ds1 = pd.Series(list1)
ds1

0    4
1    5
2    7
3    2
dtype: int64

In [5]:
ds2 = pd.Series(list1, index = ['a', 'b', 'c', 'd'])
ds2

a    4
b    5
c    7
d    2
dtype: int64

In [6]:
list1 = ['a', 'b', 'c', 'd']
list2 = [4,5,7,2]

In [7]:
ds3 = pd.Series(data = list1, index = list2)
ds3

4    a
5    b
7    c
2    d
dtype: object

In [10]:
list1 = ['a', 'b', 'c', 'd']
list2 = [4,5,7,2]
dict1 = dict(zip(list2, list1))
dict1

{4: 'a', 5: 'b', 7: 'c', 2: 'd'}

In [11]:
ds4 = pd.Series(dict1)
ds4

4    a
5    b
7    c
2    d
dtype: object

In [17]:
ds3

4    a
5    b
7    c
2    d
dtype: object

In [12]:
ds3 + ds4

4    aa
5    bb
7    cc
2    dd
dtype: object

In [13]:
ds3 + ds2

2    NaN
4    NaN
5    NaN
7    NaN
a    NaN
b    NaN
c    NaN
d    NaN
dtype: object

In [18]:
'a'+ 'a'

'aa'

In [19]:
7+7

14

In [20]:
ds4

4    a
5    b
7    c
2    d
dtype: object

In [22]:
ds4[4]

'a'

In [23]:
ds4[4:7]

Series([], dtype: object)

In [24]:
ds4[0:2]

4    a
5    b
dtype: object

In [25]:
ds2

a    4
b    5
c    7
d    2
dtype: int64

In [27]:
ds2['a':'c']

a    4
b    5
c    7
dtype: int64

In [28]:
ds2[0:3]

a    4
b    5
c    7
dtype: int64

## DataFrame

In [29]:
list1 = [4,5,7,2]
ds1 = pd.Series(list1)
ds1

0    4
1    5
2    7
3    2
dtype: int64

In [31]:
ds1['chittranjan'] = [3,4,5,6]

In [32]:
ds1

0                         4
1                         5
2                         7
3                         2
chittranjan    [3, 4, 5, 6]
dtype: object

In [30]:
list1 = [4,5,7,2]
df1 = pd.DataFrame(list1)
df1

   0
0  4
1  5
2  7
3  2

In [33]:
df1['chittranjan'] = [3,4,5,6]
df1

   0  chittranjan
0  4            3
1  5            4
2  7            5
3  2            6

In [34]:
dict1 = {'fruits': ['apple', 'orange', 'banana'],
        'count' : [5, 3, 12]}
dict1

{'fruits': ['apple', 'orange', 'banana'], 'count': [5, 3, 12]}

In [35]:
df2 = pd.DataFrame(dict1)
df2

   fruits  count
0   apple      5
1  orange      3
2  banana     12

In [36]:
ds2 = pd.Series(list1, index = ['a', 'b', 'c', 'd'])
ds2

a    4
b    5
c    7
d    2
dtype: int64

In [38]:
df3 = pd.DataFrame(ds2)
df3

   0
a  4
b  5
c  7
d  2

### Converting 5 lists to a dataframe

In [134]:
a = [1,2,3,4]
b = [5,6,7,8]
c = [9,10,1,2]
d = [3,4,5,6]
e = [7,8,9,10]

In [135]:
df5 = pd.DataFrame([a,b,c,d,e])
df5

   0   1  2   3
0  1   2  3   4
1  5   6  7   8
2  9  10  1   2
3  3   4  5   6
4  7   8  9  10

In [136]:
df5 = pd.DataFrame([a,b,c,d,e], columns = ['a', 'b', 'c', 'd'])
df5

   a   b  c   d
0  1   2  3   4
1  5   6  7   8
2  9  10  1   2
3  3   4  5   6
4  7   8  9  10

In [49]:
df5 = pd.DataFrame([a,b,c,d,e], index = ['a', 'b', 'c', 'd', 'f'])
df5

   0   1  2   3
a  1   2  3   4
b  5   6  7   8
c  9  10  1   2
d  3   4  5   6
f  7   8  9  10

In [56]:
df6 = df5.copy()

In [51]:
df6.drop('f')

   0   1  2  3
a  1   2  3  4
b  5   6  7  8
c  9  10  1  2
d  3   4  5  6

In [52]:
df6

   0   1  2   3
a  1   2  3   4
b  5   6  7   8
c  9  10  1   2
d  3   4  5   6
f  7   8  9  10

In [53]:
df7 = df6.drop('f')
df7

   0   1  2  3
a  1   2  3  4
b  5   6  7  8
c  9  10  1  2
d  3   4  5  6

In [59]:
df6

   0   1  2   3
a  1   2  3   4
b  5   6  7   8
c  9  10  1   2
d  3   4  5   6
f  7   8  9  10

In [60]:
df6.drop(2, axis = 1)

   0   1   3
a  1   2   4
b  5   6   8
c  9  10   2
d  3   4   6
f  7   8  10

In [55]:
df6

   0   1  2  3
a  1   2  3  4
b  5   6  7  8
c  9  10  1  2
d  3   4  5  6

In [62]:
df6.drop([0,1,2], axis = 1)

    3
a   4
b   8
c   2
d   6
f  10

In [63]:
df6

   0   1  2   3
a  1   2  3   4
b  5   6  7   8
c  9  10  1   2
d  3   4  5   6
f  7   8  9  10

In [65]:
df6 = df6.drop([0,1,2], axis = 1)
df6

    3
a   4
b   8
c   2
d   6
f  10

In [64]:
df7 = df6.drop([0,1,2], axis = 1)
df7

    3
a   4
b   8
c   2
d   6
f  10

In [66]:
df6.drop(3, axis = 1, inplace = True)

In [67]:
df6

Empty DataFrame
Columns: []
Index: [a, b, c, d, f]

In [69]:
df6 = df5.copy()

In [72]:
df6.drop('f', inplace = True)

In [73]:
df6

   0   1  2  3
a  1   2  3  4
b  5   6  7  8
c  9  10  1  2
d  3   4  5  6

In [74]:
df6['f'] = [7,8,9,10]

In [80]:
df6

   0   1  2  3   f  g
a  1   2  3  4   7  7
b  5   6  7  8   8  8
c  9  10  1  2   9  9
d  3   4  5  6  10  1

In [79]:
df6['g'] = [7,8, 9, 1]

In [83]:
import numpy as np
np.nan
np.inf

inf

In [84]:
df6['h'] = [1,2,np.nan, np.inf]
df6

   0   1  2  3   f  g    h
a  1   2  3  4   7  7  1.0
b  5   6  7  8   8  8  2.0
c  9  10  1  2   9  9  NaN
d  3   4  5  6  10  1  inf

In [86]:
df6['h'] = [1,2,'sunil', 'ved']
df6

   0   1  2  3   f  g      h
a  1   2  3  4   7  7      1
b  5   6  7  8   8  8      2
c  9  10  1  2   9  9  sunil
d  3   4  5  6  10  1    ved

In [88]:
df6['i'] = df6['f'] + df6['g']
df6

   0   1  2  3   f  g      h   i
a  1   2  3  4   7  7      1  14
b  5   6  7  8   8  8      2  16
c  9  10  1  2   9  9  sunil  18
d  3   4  5  6  10  1    ved  11

In [92]:
df6.drop('h', inplace = True, axis = 1)

In [93]:
df6

   0   1  2  3   f  g   i
a  1   2  3  4   7  7  14
b  5   6  7  8   8  8  16
c  9  10  1  2   9  9  18
d  3   4  5  6  10  1  11

In [94]:
df6>4

       0      1      2      3     f      g     i
a  False  False  False  False  True   True  True
b   True   True   True   True  True   True  True
c   True   True  False  False  True   True  True
d  False  False   True   True  True  False  True

In [95]:
df6[df6>4]

     0     1    2    3   f    g   i
a  NaN   NaN  NaN  NaN   7  7.0  14
b  5.0   6.0  7.0  8.0   8  8.0  16
c  9.0  10.0  NaN  NaN   9  9.0  18
d  NaN   NaN  5.0  6.0  10  NaN  11

In [99]:
df6[df6[3] > 4]

   0  1  2  3   f  g   i
b  5  6  7  8   8  8  16
d  3  4  5  6  10  1  11

In [100]:
df6

   0   1  2  3   f  g   i
a  1   2  3  4   7  7  14
b  5   6  7  8   8  8  16
c  9  10  1  2   9  9  18
d  3   4  5  6  10  1  11

In [104]:
df6[df6[3] > 4][['i', 2, 3, 'g']]

    i  2  3  g
b  16  7  8  8
d  11  5  6  1

In [110]:
df6[(df6[3] >=4)  & (df6['g'] <= 7)]

   0  1  2  3   f  g   i
a  1  2  3  4   7  7  14
d  3  4  5  6  10  1  11

In [107]:
df6

   0   1  2  3   f  g   i
a  1   2  3  4   7  7  14
b  5   6  7  8   8  8  16
c  9  10  1  2   9  9  18
d  3   4  5  6  10  1  11

In [108]:
6 >= 4

True

### Missing Data

# How do you handle missing data in python

In [111]:
import pandas as pd
import numpy as np
np.nan

nan

In [112]:
dict2 = {'a':[1,2,3,4], 'b':[6,7,8,np.nan], 'c':[1,2,np.nan, np.nan], 'd':[np.nan, np.nan, np.nan, np.nan]}

In [113]:
dict2

{'a': [1, 2, 3, 4],
 'b': [6, 7, 8, nan],
 'c': [1, 2, nan, nan],
 'd': [nan, nan, nan, nan]}

In [114]:
df1 = pd.DataFrame(dict2)
df1

   a    b    c   d
0  1  6.0  1.0 NaN
1  2  7.0  2.0 NaN
2  3  8.0  NaN NaN
3  4  NaN  NaN NaN

In [115]:
df2 = df1.copy()
df2

   a    b    c   d
0  1  6.0  1.0 NaN
1  2  7.0  2.0 NaN
2  3  8.0  NaN NaN
3  4  NaN  NaN NaN

In [118]:
# we can drop nan values
df2.dropna(axis = 1)

   a
0  1
1  2
2  3
3  4

In [120]:
df2.fillna(100)

   a      b      c      d
0  1    6.0    1.0  100.0
1  2    7.0    2.0  100.0
2  3    8.0  100.0  100.0
3  4  100.0  100.0  100.0

In [121]:
df2

   a    b    c   d
0  1  6.0  1.0 NaN
1  2  7.0  2.0 NaN
2  3  8.0  NaN NaN
3  4  NaN  NaN NaN

In [171]:
df2['b'].fillna(df2['b'].median())

0    6.0
1    7.0
2    8.0
3    7.0
Name: b, dtype: float64

In [126]:
df2.fillna(df2.mean(), axis = 0)

   a    b    c   d
0  1  6.0  1.0 NaN
1  2  7.0  2.0 NaN
2  3  8.0  1.5 NaN
3  4  7.0  1.5 NaN

In [127]:
df2.mean()

a    2.5
b    7.0
c    1.5
d    NaN
dtype: float64

In [128]:
df2.std()

a    1.290994
b    1.000000
c    0.707107
d         NaN
dtype: float64

In [129]:
df2.min()

a    1.0
b    6.0
c    1.0
d    NaN
dtype: float64

In [130]:
df2.max()

a    4.0
b    8.0
c    2.0
d    NaN
dtype: float64

In [131]:
df2.describe()

              a    b         c    d
count  4.000000  3.0  2.000000  0.0
mean   2.500000  7.0  1.500000  NaN
std    1.290994  1.0  0.707107  NaN
min    1.000000  6.0  1.000000  NaN
25%    1.750000  6.5  1.250000  NaN
50%    2.500000  7.0  1.500000  NaN
75%    3.250000  7.5  1.750000  NaN
max    4.000000  8.0  2.000000  NaN

In [132]:
df2.describe().transpose()

   count  mean       std  min   25%  50%   75%  max
a    4.0   2.5  1.290994  1.0  1.75  2.5  3.25  4.0
b    3.0   7.0  1.000000  6.0  6.50  7.0  7.50  8.0
c    2.0   1.5  0.707107  1.0  1.25  1.5  1.75  2.0
d    0.0   NaN       NaN  NaN   NaN  NaN   NaN  NaN

In [133]:
df2.describe().T

   count  mean       std  min   25%  50%   75%  max
a    4.0   2.5  1.290994  1.0  1.75  2.5  3.25  4.0
b    3.0   7.0  1.000000  6.0  6.50  7.0  7.50  8.0
c    2.0   1.5  0.707107  1.0  1.25  1.5  1.75  2.0
d    0.0   NaN       NaN  NaN   NaN  NaN   NaN  NaN

In [137]:
df5

   a   b  c   d
0  1   2  3   4
1  5   6  7   8
2  9  10  1   2
3  3   4  5   6
4  7   8  9  10

In [138]:
df2

   a    b    c   d
0  1  6.0  1.0 NaN
1  2  7.0  2.0 NaN
2  3  8.0  NaN NaN
3  4  NaN  NaN NaN

# Merge

In [140]:
pd.merge(left = df2, right = df5)

Empty DataFrame
Columns: [a, b, c, d]
Index: []

In [144]:
df2.merge(df5, on = 'b')

   a_x    b  c_x  d_x  a_y  c_y  d_y
0    1  6.0  1.0  NaN    5    7    8
1    3  8.0  NaN  NaN    7    9   10

### test ### how to merge data based on multiple columns

In [145]:
df2.merge(df5, on = 'b', how = 'inner')

   a_x    b  c_x  d_x  a_y  c_y  d_y
0    1  6.0  1.0  NaN    5    7    8
1    3  8.0  NaN  NaN    7    9   10

In [146]:
df2

   a    b    c   d
0  1  6.0  1.0 NaN
1  2  7.0  2.0 NaN
2  3  8.0  NaN NaN
3  4  NaN  NaN NaN

In [147]:
df5

   a   b  c   d
0  1   2  3   4
1  5   6  7   8
2  9  10  1   2
3  3   4  5   6
4  7   8  9  10

In [148]:
df2.merge(df5, on = 'b', how = 'left')

   a_x    b  c_x  d_x  a_y  c_y   d_y
0    1  6.0  1.0  NaN  5.0  7.0   8.0
1    2  7.0  2.0  NaN  NaN  NaN   NaN
2    3  8.0  NaN  NaN  7.0  9.0  10.0
3    4  NaN  NaN  NaN  NaN  NaN   NaN

In [149]:
df2.merge(df5, on = 'b', how = 'right')

   a_x     b  c_x  d_x  a_y  c_y  d_y
0  NaN   2.0  NaN  NaN    1    3    4
1  1.0   6.0  1.0  NaN    5    7    8
2  NaN  10.0  NaN  NaN    9    1    2
3  NaN   4.0  NaN  NaN    3    5    6
4  3.0   8.0  NaN  NaN    7    9   10

In [150]:
df2.merge(df5, on = 'b', how = 'outer')

   a_x     b  c_x  d_x  a_y  c_y   d_y
0  1.0   6.0  1.0  NaN  5.0  7.0   8.0
1  2.0   7.0  2.0  NaN  NaN  NaN   NaN
2  3.0   8.0  NaN  NaN  7.0  9.0  10.0
3  4.0   NaN  NaN  NaN  NaN  NaN   NaN
4  NaN   2.0  NaN  NaN  1.0  3.0   4.0
5  NaN  10.0  NaN  NaN  9.0  1.0   2.0
6  NaN   4.0  NaN  NaN  3.0  5.0   6.0

### Concatenation

In [155]:
pd.concat([df2,df5], axis = 1)

     a    b    c   d  a   b  c   d
0  1.0  6.0  1.0 NaN  1   2  3   4
1  2.0  7.0  2.0 NaN  5   6  7   8
2  3.0  8.0  NaN NaN  9  10  1   2
3  4.0  NaN  NaN NaN  3   4  5   6
4  NaN  NaN  NaN NaN  7   8  9  10

In [158]:
pd.concat([df2,df5], axis = 1, join = 'inner')

   a    b    c   d  a   b  c  d
0  1  6.0  1.0 NaN  1   2  3  4
1  2  7.0  2.0 NaN  5   6  7  8
2  3  8.0  NaN NaN  9  10  1  2
3  4  NaN  NaN NaN  3   4  5  6

## Join

In [164]:
df2.join(df5, on = 'a', lsuffix = '_left_', rsuffix= '_right_')

   a_left_  b_left_  c_left_  d_left_  a_right_  b_right_  c_right_  d_right_
0        1      6.0      1.0      NaN         5         6         7         8
1        2      7.0      2.0      NaN         9        10         1         2
2        3      8.0      NaN      NaN         3         4         5         6
3        4      NaN      NaN      NaN         7         8         9        10

In [166]:
df5

   a   b  c   d
0  1   2  3   4
1  5   6  7   8
2  9  10  1   2
3  3   4  5   6
4  7   8  9  10

In [168]:
grp_a = df5.groupby('a')

In [170]:
grp_a.get_group(5)

   a  b  c  d
1  5  6  7  8